import image from './assets/image.png';

export const model = [
  {
    type: 'title',
    value: 'Конструектор сайтов на native JS',
    options: {
      tag: 'h2',
      styles: {
        background: 'linear-gradient(to right, #ff0099, #493240)',
        color: '#fff',
        'text-align': 'center',
        padding: '1.5rem',
      },
    },
  },
  {
    type: 'text',
    value:
      'Задача организации, в особенности же начало повседневной работы по формированию позиции в значительной степени обуславливает создание соответствующий условий активизации. Не следует, однако забывать, что новая модель организационной деятельности способствует подготовки и реализации систем массового участия.',
    options: {
      styles: {
        padding: '1rem',
      },
    },
  },
  {
    type: 'columns',
    value: [
      'Не следует, однако забывать, что рамки и место обучения кадров в значительной степени обуславливает создание дальнейших направлений развития.',
      'Задача организации, в особенности же реализация намеченных плановых заданий позволяет выполнять важные задания по разработке соответствующий условий активизации. Значимость этих проблем настолько очевидна, что начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки систем массового участия.',
      'Товарищи! укрепление и развитие структуры позволяет оценить значение существенных финансовых и административных условий.',
      'Значимость этих проблем настолько очевидна, что постоянный количественный рост и сфера нашей активности требуют определения и уточнения систем массового участия. Равным образом укрепление и развитие структуры в значительной степени обуславливает создание дальнейших направлений развития. ',
    ],
  },
  { type: 'image', value: image },
];
